export default {
  orgTypeMap: {
    "01": "运营管理中心",
    "02": "网点",
    "03": "全行",
  },
  flowTypeMap: {
    "01": "非账户类",
    "02": "账户类",
  },
  orgNoMap: {
    "01001": "会计核算中心",
    "01292": "运营管理部集中作业中心",
    "01294": "XXXX支行",
  },
  stepNameMap: {
    "01": "全部",
    "02": "存款审核授权",
    "03": "特殊审核授权",
    "04": "贷款审核授权",
    "05": "碎片录入",
    "06": "全单录入",
    "07": "人工验印",
  },
  tellerLevelMap: {
    "01": "一级柜员",
    "02": "二级柜员",
    "03": "三级柜员",
    "04": "四级柜员",
  },
  tellerTypeMap: {
    "01": "前台柜员",
    "02": "后台柜员",
  },
  tellerStatusMap: {
    "01": "启用",
    "02": "停用",
  },
};

// 机构类型：运营管理中心、网点、全行
// 流程类型：非账户类，账户类
// 机构号/名称：01001-会计核算中心 、01292-运营管理部集中作业中心 、01294-XXXX支行
// 节点名称：全部、存款审核授权、特殊审核授权、贷款审核授权、碎片录入、全单录入、人工验印
// 柜员级别：一级柜员、二级柜员、三级柜员、四级柜员
// 柜员类型：前台柜员、后台柜员
// 柜员状态：启用、停用

// 节点名称   直接用中文搜索
// 其它都是 枚举值
